tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66k80_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F66K80_H_
#define _PIC18F66K80_H_

#define RXERRCNT                      0
#define REC                           1
#define REC0                          2
#define REC1                          3
#define REC2                          4
#define REC3                          5
#define REC4                          6
#define REC5                          7
#define REC6                          8
#define REC7                          9
#define TXERRCNT                      10
#define TEC                           11
#define TEC0                          12
#define TEC1                          13
#define TEC2                          14
#define TEC3                          15
#define TEC4                          16
#define TEC5                          17
#define TEC6                          18
#define TEC7                          19
#define BRGCON1                       20
#define BRP                           21
#define BRP0                          22
#define BRP1                          23
#define BRP2                          24
#define BRP3                          25
#define BRP4                          26
#define BRP5                          27
#define SJW                           28
#define SJW0                          29
#define SJW1                          30
#define BRGCON2                       31
#define PRSEG                         32
#define PRSEG0                        33
#define PRSEG1                        34
#define PRSEG2                        35
#define SEG1PH0                       36
#define SEG1PH                        37
#define SEG1PH1                       38
#define SEG1PH2                       39
#define SAM                           40
#define SEG2PHT                       41
#define SEG2PHTS                      42
#define BRGCON3                       43
#define SEG2PH0                       44
#define SEG2PH                        45
#define SEG2PH1                       46
#define SEG2PH2                       47
#define WAKFIL                        48
#define WAKDIS                        49
#define RXFCON0                       50
#define RXF0EN                        51
#define RXF1EN                        52
#define RXF2EN                        53
#define RXF3EN                        54
#define RXF4EN                        55
#define RXF5EN                        56
#define RXF6EN                        57
#define RXF7EN                        58
#define RXFCON1                       59
#define RXF8EN                        60
#define RXF9EN                        61
#define RXF10EN                       62
#define RXF11EN                       63
#define RXF12EN                       64
#define RXF13EN                       65
#define RXF14EN                       66
#define RXF15EN                       67
#define RXF6SIDH                      68
#define RXF6SIDH_SID3                 69
#define RXF6SIDH_SID                  70
#define RXF6SID3                      71
#define RXF6SIDH_SID4                 72
#define RXF6SID4                      73
#define RXF6SIDH_SID5                 74
#define RXF6SID5                      75
#define RXF6SIDH_SID6                 76
#define RXF6SID6                      77
#define RXF6SIDH_SID7                 78
#define RXF6SID7                      79
#define RXF6SIDH_SID8                 80
#define RXF6SID8                      81
#define RXF6SIDH_SID9                 82
#define RXF6SID9                      83
#define RXF6SID10                     84
#define RXF6SIDH_SID10                85
#define RXF6SIDL                      86
#define RXF6SIDL_EID16                87
#define RXF6EID16                     88
#define RXF6SIDL_EID                  89
#define RXF6SIDL_EID17                90
#define RXF6EID17                     91
#define RXF6EXIDEN                    92
#define RXF6SIDL_EXIDEN               93
#define RXF6SIDL_SID0                 94
#define RXF6SID0                      95
#define RXF6SIDL_SID                  96
#define RXF6SIDL_SID1                 97
#define RXF6SID1                      98
#define RXF6SIDL_SID2                 99
#define RXF6SID2                      100
#define RXF6EIDH                      101
#define RXF6EIDH_EID8                 102
#define RXF6EID8                      103
#define RXF6EIDH_EID                  104
#define RXF6EIDH_EID9                 105
#define RXF6EID9                      106
#define RXF6EIDH_EID10                107
#define RXF6EID10                     108
#define RXF6EIDH_EID11                109
#define RXF6EID11                     110
#define RXF6EIDH_EID12                111
#define RXF6EID12                     112
#define RXF6EIDH_EID13                113
#define RXF6EID13                     114
#define RXF6EIDH_EID14                115
#define RXF6EID14                     116
#define RXF6EIDH_EID15                117
#define RXF6EID15                     118
#define RXF6EIDL                      119
#define RXF6EIDL_EID                  120
#define RXF6EIDL_EID0                 121
#define RXF6EID0                      122
#define RXF6EIDL_EID1                 123
#define RXF6EID1                      124
#define RXF6EIDL_EID2                 125
#define RXF6EID2                      126
#define RXF6EIDL_EID3                 127
#define RXF6EID3                      128
#define RXF6EIDL_EID4                 129
#define RXF6EID4                      130
#define RXF6EIDL_EID5                 131
#define RXF6EID5                      132
#define RXF6EIDL_EID6                 133
#define RXF6EID6                      134
#define RXF6EIDL_EID7                 135
#define RXF6EID7                      136
#define RXF7SIDH                      137
#define RXF7SID3                      138
#define RXF7SIDH_SID3                 139
#define RXF7SIDH_SID                  140
#define RXF7SID4                      141
#define RXF7SIDH_SID4                 142
#define RXF7SID5                      143
#define RXF7SIDH_SID5                 144
#define RXF7SID6                      145
#define RXF7SIDH_SID6                 146
#define RXF7SID7                      147
#define RXF7SIDH_SID7                 148
#define RXF7SID8                      149
#define RXF7SIDH_SID8                 150
#define RXF7SID9                      151
#define RXF7SIDH_SID9                 152
#define RXF7SIDH_SID10                153
#define RXF7SID10                     154
#define RXF7SIDL                      155
#define RXF7EID16                     156
#define RXF7SIDL_EID16                157
#define RXF7SIDL_EID                  158
#define RXF7EID17                     159
#define RXF7SIDL_EID17                160
#define RXF7EXIDEN                    161
#define RXF7SIDL_EXIDEN               162
#define RXF7SID0                      163
#define RXF7SIDL_SID0                 164
#define RXF7SIDL_SID                  165
#define RXF7SID1                      166
#define RXF7SIDL_SID1                 167
#define RXF7SIDL_SID2                 168
#define RXF7SID2                      169
#define RXF7EIDH                      170
#define RXF7EIDH_EID                  171
#define RXF7EID8                      172
#define RXF7EIDH_EID8                 173
#define RXF7EID9                      174
#define RXF7EIDH_EID9                 175
#define RXF7EID10                     176
#define RXF7EIDH_EID10                177
#define RXF7EID11                     178
#define RXF7EIDH_EID11                179
#define RXF7EID12                     180
#define RXF7EIDH_EID12                181
#define RXF7EID13                     182
#define RXF7EIDH_EID13                183
#define RXF7EID14                     184
#define RXF7EIDH_EID14                185
#define RXF7EID15                     186
#define RXF7EIDH_EID15                187
#define RXF7EIDL                      188
#define RXF7EIDL_EID0                 189
#define RXF7EID0                      190
#define RXF7EIDL_EID                  191
#define RXF7EIDL_EID1                 192
#define RXF7EID1                      193
#define RXF7EIDL_EID2                 194
#define RXF7EID2                      195
#define RXF7EIDL_EID3                 196
#define RXF7EID3                      197
#define RXF7EIDL_EID4                 198
#define RXF7EID4                      199
#define RXF7EIDL_EID5                 200
#define RXF7EID5                      201
#define RXF7EIDL_EID6                 202
#define RXF7EID6                      203
#define RXF7EIDL_EID7                 204
#define RXF7EID7                      205
#define RXF8SIDH                      206
#define RXF8SIDH_SID                  207
#define RXF8SID3                      208
#define RXF8SIDH_SID3                 209
#define RXF8SID4                      210
#define RXF8SIDH_SID4                 211
#define RXF8SID5                      212
#define RXF8SIDH_SID5                 213
#define RXF8SID6                      214
#define RXF8SIDH_SID6                 215
#define RXF8SID7                      216
#define RXF8SIDH_SID7                 217
#define RXF8SID8                      218
#define RXF8SIDH_SID8                 219
#define RXF8SID9                      220
#define RXF8SIDH_SID9                 221
#define RXF8SID10                     222
#define RXF8SIDH_SID10                223
#define RXF8SIDL                      224
#define RXF8SIDL_EID                  225
#define RXF8SIDL_EID16                226
#define RXF8EID16                     227
#define RXF8SIDL_EID17                228
#define RXF8EID17                     229
#define RXF8SIDL_EXIDEN               230
#define RXF8EXIDEN                    231
#define RXF8SID0                      232
#define RXF8SIDL_SID0                 233
#define RXF8SIDL_SID                  234
#define RXF8SID1                      235
#define RXF8SIDL_SID1                 236
#define RXF8SIDL_SID2                 237
#define RXF8SID2                      238
#define RXF8EIDH                      239
#define RXF8EID8                      240
#define RXF8EIDH_EID                  241
#define RXF8EIDH_EID8                 242
#define RXF8EID9                      243
#define RXF8EIDH_EID9                 244
#define RXF8EID10                     245
#define RXF8EIDH_EID10                246
#define RXF8EID11                     247
#define RXF8EIDH_EID11                248
#define RXF8EID12                     249
#define RXF8EIDH_EID12                250
#define RXF8EID13                     251
#define RXF8EIDH_EID13                252
#define RXF8EID14                     253
#define RXF8EIDH_EID14                254
#define RXF8EID15                     255
#define RXF8EIDH_EID15                256
#define RXF8EIDL                      257
#define RXF8EIDL_EID0                 258
#define RXF8EID0                      259
#define RXF8EIDL_EID                  260
#define RXF8EIDL_EID1                 261
#define RXF8EID1                      262
#define RXF8EIDL_EID2                 263
#define RXF8EID2                      264
#define RXF8EIDL_EID3                 265
#define RXF8EID3                      266
#define RXF8EIDL_EID4                 267
#define RXF8EID4                      268
#define RXF8EIDL_EID5                 269
#define RXF8EID5                      270
#define RXF8EIDL_EID6                 271
#define RXF8EID6                      272
#define RXF8EIDL_EID7                 273
#define RXF8EID7                      274
#define RXF9SIDH                      275
#define RXF9SID3                      276
#define RXF9SIDH_SID3                 277
#define RXF9SIDH_SID                  278
#define RXF9SID4                      279
#define RXF9SIDH_SID4                 280
#define RXF9SID5                      281
#define RXF9SIDH_SID5                 282
#define RXF9SID6                      283
#define RXF9SIDH_SID6                 284
#define RXF9SID7                      285
#define RXF9SIDH_SID7                 286
#define RXF9SID8                      287
#define RXF9SIDH_SID8                 288
#define RXF9SID9                      289
#define RXF9SIDH_SID9                 290
#define RXF9SID10                     291
#define RXF9SIDH_SID10                292
#define RXF9SIDL                      293
#define RXF9SIDL_EID16                294
#define RXF9SIDL_EID                  295
#define RXF9EID16                     296
#define RXF9SIDL_EID17                297
#define RXF9EID17                     298
#define RXF9EXIDEN                    299
#define RXF9SIDL_EXIDEN               300
#define RXF9SIDL_SID                  301
#define RXF9SIDL_SID0                 302
#define RXF9SID0                      303
#define RXF9SIDL_SID1                 304
#define RXF9SID1                      305
#define RXF9SIDL_SID2                 306
#define RXF9SID2                      307
#define RXF9EIDH                      308
#define RXF9EID8                      309
#define RXF9EIDH_EID8                 310
#define RXF9EIDH_EID                  311
#define RXF9EID9                      312
#define RXF9EIDH_EID9                 313
#define RXF9EIDH_EID10                314
#define RXF9EID10                     315
#define RXF9EIDH_EID11                316
#define RXF9EID11                     317
#define RXF9EIDH_EID12                318
#define RXF9EID12                     319
#define RXF9EIDH_EID13                320
#define RXF9EID13                     321
#define RXF9EIDH_EID14                322
#define RXF9EID14                     323
#define RXF9EIDH_EID15                324
#define RXF9EID15                     325
#define RXF9EIDL                      326
#define RXF9EID0                      327
#define RXF9EIDL_EID                  328
#define RXF9EIDL_EID0                 329
#define RXF9EID1                      330
#define RXF9EIDL_EID1                 331
#define RXF9EID2                      332
#define RXF9EIDL_EID2                 333
#define RXF9EID3                      334
#define RXF9EIDL_EID3                 335
#define RXF9EID4                      336
#define RXF9EIDL_EID4                 337
#define RXF9EID5                      338
#define RXF9EIDL_EID5                 339
#define RXF9EID6                      340
#define RXF9EIDL_EID6                 341
#define RXF9EID7                      342
#define RXF9EIDL_EID7                 343
#define RXF10SIDH                     344
#define RXF10SIDH_SID                 345
#define RXF10SIDH_SID3                346
#define RXF10SID3                     347
#define RXF10SIDH_SID4                348
#define RXF10SID4                     349
#define RXF10SIDH_SID5                350
#define RXF10SID5                     351
#define RXF10SIDH_SID6                352
#define RXF10SID6                     353
#define RXF10SIDH_SID7                354
#define RXF10SID7                     355
#define RXF10SIDH_SID8                356
#define RXF10SID8                     357
#define RXF10SIDH_SID9                358
#define RXF10SID9                     359
#define RXF10SID10                    360
#define RXF10SIDH_SID10               361
#define RXF10SIDL                     362
#define RXF10SIDL_EID16               363
#define RXF10SIDL_EID                 364
#define RXF10EID16                    365
#define RXF10SIDL_EID17               366
#define RXF10EID17                    367
#define RXF10EXIDEN                   368
#define RXF10SIDL_EXIDEN              369
#define RXF10SIDL_SID0                370
#define RXF10SIDL_SID                 371
#define RXF10SID0                     372
#define RXF10SIDL_SID1                373
#define RXF10SID1                     374
#define RXF10SIDL_SID2                375
#define RXF10SID2                     376
#define RXF10EIDH                     377
#define RXF10EID8                     378
#define RXF10EIDH_EID                 379
#define RXF10EIDH_EID8                380
#define RXF10EID9                     381
#define RXF10EIDH_EID9                382
#define RXF10EIDH_EID10               383
#define RXF10EID10                    384
#define RXF10EIDH_EID11               385
#define RXF10EID11                    386
#define RXF10EIDH_EID12               387
#define RXF10EID12                    388
#define RXF10EIDH_EID13               389
#define RXF10EID13                    390
#define RXF10EIDH_EID14               391
#define RXF10EID14                    392
#define RXF10EIDH_EID15               393
#define RXF10EID15                    394
#define RXF10EIDL                     395
#define RXF10EID0                     396
#define RXF10EIDL_EID0                397
#define RXF10EIDL_EID                 398
#define RXF10EID1                     399
#define RXF10EIDL_EID1                400
#define RXF10EID2                     401
#define RXF10EIDL_EID2                402
#define RXF10EID3                     403
#define RXF10EIDL_EID3                404
#define RXF10EID4                     405
#define RXF10EIDL_EID4                406
#define RXF10EID5                     407
#define RXF10EIDL_EID5                408
#define RXF10EID6                     409
#define RXF10EIDL_EID6                410
#define RXF10EID7                     411
#define RXF10EIDL_EID7                412
#define RXF11SIDH                     413
#define RXF11SID3                     414
#define RXFSID                        415
#define RXF11SIDH_SID3                416
#define RXF11SID4                     417
#define RXF11SIDH_SID4                418
#define RXF11SID5                     419
#define RXF11SIDH_SID5                420
#define RXF11SID6                     421
#define RXF11SIDH_SID6                422
#define RXF11SID7                     423
#define RXF11SIDH_SID7                424
#define RXF11SID8                     425
#define RXF11SIDH_SID8                426
#define RXF11SID9                     427
#define RXF11SIDH_SID9                428
#define RXF11SIDH_SID10               429
#define RXF11SID10                    430
#define RXF11SIDL                     431
#define RXF11EID16                    432
#define RXF11SIDL_EID16               433
#define RXF11SIDL_EID                 434
#define RXF11EID17                    435
#define RXF11SIDL_EID17               436
#define RXF11EXIDEN                   437
#define RXF11SIDL_EXIDEN              438
#define RXF11SIDL_SID                 439
#define RXF11SIDL_SID0                440
#define RXF11SID0                     441
#define RXF11SIDL_SID1                442
#define RXF11SID1                     443
#define RXF11SID2                     444
#define RXF11SIDL_SID2                445
#define RXF11EIDH                     446
#define RXF11EID8                     447
#define RXF11EIDH_EID8                448
#define RXF11EIDH_EID                 449
#define RXF11EIDH_EID9                450
#define RXF11EID9                     451
#define RXF11EID10                    452
#define RXF11EIDH_EID10               453
#define RXF11EID11                    454
#define RXF11EIDH_EID11               455
#define RXF11EID12                    456
#define RXF11EIDH_EID12               457
#define RXF11EID13                    458
#define RXF11EIDH_EID13               459
#define RXF11EID14                    460
#define RXF11EIDH_EID14               461
#define RXF11EID15                    462
#define RXF11EIDH_EID15               463
#define RXF11EIDL                     464
#define RXF11EID0                     465
#define RXF11EIDL_EID0                466
#define RXF11EIDL_EID                 467
#define RXF11EID1                     468
#define RXF11EIDL_EID1                469
#define RXF11EID2                     470
#define RXF11EIDL_EID2                471
#define RXF11EID3                     472
#define RXF11EIDL_EID3                473
#define RXF11EID4                     474
#define RXF11EIDL_EID4                475
#define RXF11EID5                     476
#define RXF11EIDL_EID5                477
#define RXF11EID6                     478
#define RXF11EIDL_EID6                479
#define RXF11EID7                     480
#define RXF11EIDL_EID7                481
#define RXF12SIDH                     482
#define RXF12SID3                     483
#define RXF12SIDH_SID                 484
#define RXF12SIDH_SID3                485
#define RXF12SID4                     486
#define RXF12SIDH_SID4                487
#define RXF12SID5                     488
#define RXF12SIDH_SID5                489
#define RXF12SIDH_SID6                490
#define RXF12SID6                     491
#define RXF12SIDH_SID7                492
#define RXF12SID7                     493
#define RXF12SID8                     494
#define RXF12SIDH_SID8                495
#define RXF12SID9                     496
#define RXF12SIDH_SID9                497
#define RXF12SIDH_SID10               498
#define RXF12SID10                    499
#define RXF12SIDL                     500
#define RXF12EID16                    501
#define RXF12SIDL_EID                 502
#define RXF12SIDL_EID16               503
#define RXF12EID17                    504
#define RXF12SIDL_EID17               505
#define RXF12EXIDEN                   506
#define RXF12SIDL_EXIDEN              507
#define RXF12SIDL_SID0                508
#define RXF12SID0                     509
#define RXF12SIDL_SID                 510
#define RXF12SID1                     511
#define RXF12SIDL_SID1                512
#define RXF12SIDL_SID2                513
#define RXF12SID2                     514
#define RXF12EIDH                     515
#define RXF12EIDH_EID                 516
#define RXF12EID8                     517
#define RXF12EIDH_EID8                518
#define RXF12EID9                     519
#define RXF12EIDH_EID9                520
#define RXF12EID10                    521
