tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66k80_tdd.h
#define B5EIDL_EID4                   2207
#define B5EID5                        2208
#define B5EIDL_EID5                   2209
#define B5EID6                        2210
#define B5EIDL_EID6                   2211
#define B5EID7                        2212
#define B5EIDL_EID7                   2213
#define B5DLC                         2214
#define B5DLC0                        2215
#define B5DLC_DLC0                    2216
#define B5DLC_DLC                     2217
#define B5DLC1                        2218
#define B5DLC_DLC1                    2219
#define B5DLC2                        2220
#define B5DLC_DLC2                    2221
#define B5DLC3                        2222
#define B5DLC_DLC3                    2223
#define B5DLC_RB                      2224
#define B5DLC_RB0                     2225
#define B5RB0                         2226
#define B5DLC_RB1                     2227
#define B5RB1                         2228
#define B5DLC_RXRTR                   2229
#define B5DLC_RXRTR_TXRTR             2230
#define B5DLC_TXRTR                   2231
#define B5RXRTR                       2232
#define B5D00                         2233
#define B5D0                          2234
#define B5D01                         2235
#define B5D02                         2236
#define B5D03                         2237
#define B5D04                         2238
#define B5D05                         2239
#define B5D06                         2240
#define B5D07                         2241
#define B5D1                          2242
#define B5D10                         2243
#define B5D11                         2244
#define B5D12                         2245
#define B5D13                         2246
#define B5D14                         2247
#define B5D15                         2248
#define B5D16                         2249
#define B5D17                         2250
#define B5D2                          2251
#define B5D20                         2252
#define B5D21                         2253
#define B5D22                         2254
#define B5D23                         2255
#define B5D24                         2256
#define B5D25                         2257
#define B5D26                         2258
#define B5D27                         2259
#define B5D3                          2260
#define B5D30                         2261
#define B5D31                         2262
#define B5D32                         2263
#define B5D33                         2264
#define B5D34                         2265
#define B5D35                         2266
#define B5D36                         2267
#define B5D37                         2268
#define B5D4                          2269
#define B5D40                         2270
#define B5D41                         2271
#define B5D42                         2272
#define B5D43                         2273
#define B5D44                         2274
#define B5D45                         2275
#define B5D46                         2276
#define B5D47                         2277
#define B5D5                          2278
#define B5D50                         2279
#define B5D51                         2280
#define B5D52                         2281
#define B5D53                         2282
#define B5D54                         2283
#define B5D55                         2284
#define B5D56                         2285
#define B5D57                         2286
#define B5D6                          2287
#define B5D60                         2288
#define B5D61                         2289
#define B5D62                         2290
#define B5D63                         2291
#define B5D64                         2292
#define B5D65                         2293
#define B5D66                         2294
#define B5D67                         2295
#define B5D7                          2296
#define B5D70                         2297
#define B5D71                         2298
#define B5D72                         2299
#define B5D73                         2300
#define B5D74                         2301
#define B5D75                         2302
#define B5D76                         2303
#define B5D77                         2304
#define CANSTAT_RO4                   2305
#define CANSTAT_RO4_EICODE0           2306
#define CANSTAT_RO4_EICODE1           2307
#define CANSTAT_RO4_EICODE1_ICODE0    2308
#define CANSTAT_RO4_ICODE0            2309
#define CANSTAT_RO4_EICODE2           2310
#define CANSTAT_RO4_EICODE2_ICODE1    2311
#define CANSTAT_RO4_ICODE1            2312
#define CANSTAT_RO4_EICODE3           2313
#define CANSTAT_RO4_EICODE3_ICODE2    2314
#define CANSTAT_RO4_ICODE2            2315
#define CANSTAT_RO4_EICODE4           2316
#define CANSTAT_RO4_OPMODE0           2317
#define CANSTAT_RO4_OPMODE            2318
#define CANSTAT_RO4_OPMODE1           2319
#define CANSTAT_RO4_OPMODE2           2320
#define CANCON_RO4                    2321
#define CANCON_RO4_FP0                2322
#define CANCON_RO4_WIN0_FP1           2323
#define CANCON_RO4_FP1                2324
#define CANCON_RO4_WIN0               2325
#define CANCON_RO4_WIN1_FP2           2326
#define CANCON_RO4_FP2                2327
#define CANCON_RO4_WIN1               2328
#define CANCON_RO4_FP3                2329
#define CANCON_RO4_WIN2_FP3           2330
#define CANCON_RO4_WIN2               2331
#define CANCON_RO4_ABAT               2332
#define CANCON_RO4_REQOP              2333
#define RXF0SIDH                      2334
#define RXF0SIDH_SID3                 2335
#define RXF0SID3                      2336
#define RXF0SIDH_SID                  2337
#define RXF0SIDH_SID4                 2338
#define RXF0SID4                      2339
#define RXF0SIDH_SID5                 2340
#define RXF0SID5                      2341
#define RXF0SIDH_SID6                 2342
#define RXF0SID6                      2343
#define RXF0SIDH_SID7                 2344
#define RXF0SID7                      2345
#define RXF0SIDH_SID8                 2346
#define RXF0SID8                      2347
#define RXF0SIDH_SID9                 2348
#define RXF0SID9                      2349
#define RXF0SIDH_SID10                2350
#define RXF0SID10                     2351
#define RXF0SIDL                      2352
#define RXF0SIDL_EID                  2353
#define RXF0SIDL_EID16                2354
#define RXF0EID16                     2355
#define RXF0SIDL_EID17                2356
#define RXF0EID17                     2357
#define RXF0EXIDEN                    2358
#define RXF0SIDL_EXIDEN               2359
#define RXF0SID0                      2360
#define RXF0SIDL_SID0                 2361
#define RXF0SIDL_SID                  2362
#define RXF0SID1                      2363
#define RXF0SIDL_SID1                 2364
#define RXF0SID2                      2365
#define RXF0SIDL_SID2                 2366
#define RXF0EIDH                      2367
#define RXF0EIDH_EID8                 2368
#define RXF0EID8                      2369
#define RXF0EIDH_EID                  2370
#define RXF0EIDH_EID9                 2371
#define RXF0EID9                      2372
#define RXF0EIDH_EID10                2373
#define RXF0EID10                     2374
#define RXF0EIDH_EID11                2375
#define RXF0EID11                     2376
#define RXF0EIDH_EID12                2377
#define RXF0EID12                     2378
#define RXF0EIDH_EID13                2379
#define RXF0EID13                     2380
#define RXF0EIDH_EID14                2381
#define RXF0EID14                     2382
#define RXF0EIDH_EID15                2383
#define RXF0EID15                     2384
#define RXF0EIDL                      2385
#define RXF0EIDL_EID0                 2386
#define RXF0EID0                      2387
#define RXF0EIDL_EID                  2388
#define RXF0EIDL_EID1                 2389
#define RXF0EID1                      2390
#define RXF0EIDL_EID2                 2391
#define RXF0EID2                      2392
#define RXF0EIDL_EID3                 2393
#define RXF0EID3                      2394
#define RXF0EIDL_EID4                 2395
#define RXF0EID4                      2396
#define RXF0EIDL_EID5                 2397
#define RXF0EID5                      2398
#define RXF0EIDL_EID6                 2399
#define RXF0EID6                      2400
#define RXF0EIDL_EID7                 2401
#define RXF0EID7                      2402
#define RXF1SIDH                      2403
#define RXF1SID3                      2404
#define RXF1SIDH_SID3                 2405
#define RXF1SIDH_SID                  2406
#define RXF1SID4                      2407
#define RXF1SIDH_SID4                 2408
#define RXF1SID5                      2409
#define RXF1SIDH_SID5                 2410
#define RXF1SID6                      2411
#define RXF1SIDH_SID6                 2412
#define RXF1SID7                      2413
#define RXF1SIDH_SID7                 2414
#define RXF1SID8                      2415
#define RXF1SIDH_SID8                 2416
#define RXF1SID9                      2417
#define RXF1SIDH_SID9                 2418
#define RXF1SIDH_SID10                2419
#define RXF1SID10                     2420
#define RXF1SIDL                      2421
#define RXF1SIDL_EID                  2422
#define RXF1SIDL_EID16                2423
#define RXF1EID16                     2424
#define RXF1EID17                     2425
#define RXF1SIDL_EID17                2426
#define RXF1EXIDEN                    2427
#define RXF1SIDL_EXIDEN               2428
#define RXF1SIDL_SID0                 2429
#define RXF1SIDL_SID                  2430
#define RXF1SID0                      2431
#define RXF1SIDL_SID1                 2432
#define RXF1SID1                      2433
#define RXF1SID2                      2434
#define RXF1SIDL_SID2                 2435
#define RXF1EIDH                      2436
#define RXF1EIDH_EID                  2437
#define RXF1EID8                      2438
#define RXF1EIDH_EID8                 2439
#define RXF1EID9                      2440
#define RXF1EIDH_EID9                 2441
#define RXF1EIDH_EID10                2442
#define RXF1EID10                     2443
#define RXF1EIDH_EID11                2444
#define RXF1EID11                     2445
#define RXF1EIDH_EID12                2446
#define RXF1EID12                     2447
#define RXF1EIDH_EID13                2448
#define RXF1EID13                     2449
#define RXF1EIDH_EID14                2450
#define RXF1EID14                     2451
#define RXF1EIDH_EID15                2452
#define RXF1EID15                     2453
#define RXF1EIDL                      2454
#define RXF1EIDL_EID                  2455
#define RXF1EID0                      2456
#define RXF1EIDL_EID0                 2457
#define RXF1EID1                      2458
#define RXF1EIDL_EID1                 2459
#define RXF1EID2                      2460
#define RXF1EIDL_EID2                 2461
#define RXF1EID3                      2462
#define RXF1EIDL_EID3                 2463
#define RXF1EID4                      2464
#define RXF1EIDL_EID4                 2465
#define RXF1EID5                      2466
#define RXF1EIDL_EID5                 2467
#define RXF1EID6                      2468
#define RXF1EIDL_EID6                 2469
#define RXF1EIDL_EID7                 2470
#define RXF1EID7                      2471
#define RXF2SIDH                      2472
#define RXF2SIDH_SID                  2473
#define RXF2SID3                      2474
#define RXF2SIDH_SID3                 2475
#define RXF2SID4                      2476
#define RXF2SIDH_SID4                 2477
#define RXF2SID5                      2478
#define RXF2SIDH_SID5                 2479
#define RXF2SID6                      2480
#define RXF2SIDH_SID6                 2481
#define RXF2SID7                      2482
#define RXF2SIDH_SID7                 2483
#define RXF2SID8                      2484
#define RXF2SIDH_SID8                 2485
#define RXF2SID9                      2486
#define RXF2SIDH_SID9                 2487
#define RXF2SID10                     2488
#define RXF2SIDH_SID10                2489
#define RXF2SIDL                      2490
#define RXF2SIDL_EID16                2491
#define RXF2SIDL_EID                  2492
#define RXF2EID16                     2493
#define RXF2SIDL_EID17                2494
#define RXF2EID17                     2495
#define RXF2EXIDEN                    2496
#define RXF2SIDL_EXIDEN               2497
#define RXF2SID0                      2498
#define RXF2SIDL_SID0                 2499
#define RXF2SIDL_SID                  2500
#define RXF2SID1                      2501
#define RXF2SIDL_SID1                 2502
#define RXF2SID2                      2503
#define RXF2SIDL_SID2                 2504
#define RXF2EIDH                      2505
#define RXF2EIDH_EID                  2506
#define RXF2EID8                      2507
#define RXF2EIDH_EID8                 2508
#define RXF2EID9                      2509
#define RXF2EIDH_EID9                 2510
#define RXF2EID10                     2511
#define RXF2EIDH_EID10                2512
#define RXF2EID11                     2513
#define RXF2EIDH_EID11                2514
#define RXF2EID12                     2515
#define RXF2EIDH_EID12                2516
#define RXF2EID13                     2517
#define RXF2EIDH_EID13                2518
#define RXF2EID14                     2519
#define RXF2EIDH_EID14                2520
#define RXF2EID15                     2521
#define RXF2EIDH_EID15                2522
#define RXF2EIDL                      2523
#define RXF2EIDL_EID                  2524
#define RXF2EID0                      2525
#define RXF2EIDL_EID0                 2526
#define RXF2EID1                      2527
#define RXF2EIDL_EID1                 2528
#define RXF2EID2                      2529
#define RXF2EIDL_EID2                 2530
#define RXF2EID3                      2531
#define RXF2EIDL_EID3                 2532
#define RXF2EID4                      2533
#define RXF2EIDL_EID4                 2534
#define RXF2EID5                      2535
#define RXF2EIDL_EID5                 2536
#define RXF2EID6                      2537
#define RXF2EIDL_EID6                 2538
#define RXF2EID7                      2539
#define RXF2EIDL_EID7                 2540
#define RXF3SIDH                      2541
#define RXF3SID3                      2542
#define RXF3SIDH_SID                  2543
#define RXF3SIDH_SID3                 2544
#define RXF3SID4                      2545
#define RXF3SIDH_SID4                 2546
#define RXF3SID5                      2547
#define RXF3SIDH_SID5                 2548
#define RXF3SID6                      2549
#define RXF3SIDH_SID6                 2550
#define RXF3SID7                      2551
#define RXF3SIDH_SID7                 2552
#define RXF3SID8                      2553
#define RXF3SIDH_SID8                 2554
#define RXF3SID9                      2555
#define RXF3SIDH_SID9                 2556
#define RXF3SIDH_SID10                2557
#define RXF3SID10                     2558
#define RXF3SIDL                      2559
#define RXF3SIDL_EID16                2560
#define RXF3SIDL_EID                  2561
#define RXF3EID16                     2562
#define RXF3EID17                     2563
#define RXF3SIDL_EID17                2564
#define RXF3SIDL_EXIDEN               2565
#define RXF3EXIDEN                    2566
#define RXF3SIDL_SID0                 2567
#define RXF3SID0                      2568
#define RXF3SIDL_SID                  2569
#define RXF3SIDL_SID1                 2570
#define RXF3SID1                      2571
#define RXF3SIDL_SID2                 2572
#define RXF3SID2                      2573
#define RXF3EIDH                      2574
#define RXF3EIDH_EID8                 2575
#define RXF3EID8                      2576
#define RXF3EIDH_EID                  2577
#define RXF3EIDH_EID9                 2578
#define RXF3EID9                      2579
#define RXF3EIDH_EID10                2580
#define RXF3EID10                     2581
#define RXF3EIDH_EID11                2582
#define RXF3EID11                     2583
#define RXF3EIDH_EID12                2584
#define RXF3EID12                     2585
#define RXF3EIDH_EID13                2586
#define RXF3EID13                     2587
#define RXF3EIDH_EID14                2588
#define RXF3EID14                     2589
#define RXF3EIDH_EID15                2590
#define RXF3EID15                     2591
#define RXF3EIDL                      2592
#define RXF3EID0                      2593
#define RXF3EIDL_EID                  2594
#define RXF3EIDL_EID0                 2595
#define RXF3EID1                      2596
#define RXF3EIDL_EID1                 2597
#define RXF3EID2                      2598
#define RXF3EIDL_EID2                 2599
#define RXF3EID3                      2600
#define RXF3EIDL_EID3                 2601
#define RXF3EID4                      2602
#define RXF3EIDL_EID4                 2603
#define RXF3EID5                      2604
#define RXF3EIDL_EID5                 2605
#define RXF3EID6                      2606
#define RXF3EIDL_EID6                 2607
#define RXF3EID7                      2608
#define RXF3EIDL_EID7                 2609
#define RXF4SIDH                      2610
#define RXF4SID3                      2611
#define RXF4SIDH_SID3                 2612
#define RXF4SIDH_SID                  2613
#define RXF4SID4                      2614
#define RXF4SIDH_SID4                 2615
#define RXF4SID5                      2616
#define RXF4SIDH_SID5                 2617
#define RXF4SID6                      2618
#define RXF4SIDH_SID6                 2619
#define RXF4SID7                      2620
#define RXF4SIDH_SID7                 2621
#define RXF4SID8                      2622
#define RXF4SIDH_SID8                 2623
#define RXF4SID9                      2624
#define RXF4SIDH_SID9                 2625
#define RXF4SIDH_SID10                2626
#define RXF4SID10                     2627
#define RXF4SIDL                      2628
#define RXF4SIDL_EID                  2629
#define RXF4SIDL_EID16                2630
#define RXF4EID16                     2631
#define RXF4SIDL_EID17                2632
#define RXF4EID17                     2633
#define RXF4SIDL_EXIDEN               2634
#define RXF4EXIDEN                    2635
#define RXF4SIDL_SID                  2636
#define RXF4SID0                      2637
#define RXF4SIDL_SID0                 2638
#define RXF4SIDL_SID1                 2639
#define RXF4SID1                      2640
#define RXF4SID2                      2641
#define RXF4SIDL_SID2                 2642
#define RXF4EIDH                      2643
#define RXF4EIDH_EID                  2644
#define RXF4EID8                      2645
#define RXF4EIDH_EID8                 2646
#define RXF4EID9                      2647
#define RXF4EIDH_EID9                 2648
#define RXF4EID10                     2649
#define RXF4EIDH_EID10                2650
#define RXF4EID11                     2651
#define RXF4EIDH_EID11                2652
#define RXF4EID12                     2653
#define RXF4EIDH_EID12                2654
#define RXF4EID13                     2655
#define RXF4EIDH_EID13                2656
#define RXF4EID14                     2657
#define RXF4EIDH_EID14                2658
#define RXF4EID15                     2659
#define RXF4EIDH_EID15                2660
#define RXF4EIDL                      2661
#define RXF4EID0                      2662
#define RXF4EIDL_EID0                 2663
#define RXF4EIDL_EID                  2664
#define RXF4EID1                      2665
#define RXF4EIDL_EID1                 2666
#define RXF4EID2                      2667
#define RXF4EIDL_EID2                 2668
#define RXF4EID3                      2669
#define RXF4EIDL_EID3                 2670
#define RXF4EID4                      2671
#define RXF4EIDL_EID4                 2672
#define RXF4EID5                      2673
#define RXF4EIDL_EID5                 2674
#define RXF4EID6                      2675
#define RXF4EIDL_EID6                 2676
#define RXF4EID7                      2677
#define RXF4EIDL_EID7                 2678
#define RXF5SIDH                      2679
#define RXF5SIDH_SID3                 2680
#define RXF5SIDH_SID                  2681
#define RXF5SID3                      2682
#define RXF5SIDH_SID4                 2683
#define RXF5SID4                      2684
#define RXF5SIDH_SID5                 2685
#define RXF5SID5                      2686
#define RXF5SIDH_SID6                 2687
#define RXF5SID6                      2688
#define RXF5SIDH_SID7                 2689
#define RXF5SID7                      2690
#define RXF5SIDH_SID8                 2691
#define RXF5SID8                      2692
#define RXF5SIDH_SID9                 2693
#define RXF5SID9                      2694
#define RXF5SIDH_SID10                2695
#define RXF5SID10                     2696
#define RXF5SIDL                      2697
#define RXF5EID16                     2698
#define RXF5SIDL_EID16                2699
#define RXF5SIDL_EID                  2700
#define RXF5EID17                     2701
#define RXF5SIDL_EID17                2702
#define RXF5SIDL_EXIDEN               2703
#define RXF5EXIDEN                    2704
#define RXF5SIDL_SID                  2705
#define RXF5SIDL_SID0                 2706
#define RXF5SID0                      2707
#define RXF5SID1                      2708
#define RXF5SIDL_SID1                 2709
#define RXF5SIDL_SID2                 2710
#define RXF5SID2                      2711
#define RXF5EIDH                      2712
#define RXF5EIDH_EID                  2713
#define RXF5EIDH_EID8                 2714
#define RXF5EID8                      2715
#define RXF5EIDH_EID9                 2716
#define RXF5EID9                      2717
#define RXF5EIDH_EID10                2718
#define RXF5EID10                     2719
#define RXF5EIDH_EID11                2720
#define RXF5EID11                     2721
#define RXF5EIDH_EID12                2722
#define RXF5EID12                     2723
#define RXF5EIDH_EID13                2724
#define RXF5EID13                     2725
#define RXF5EIDH_EID14                2726
#define RXF5EID14                     2727
#define RXF5EIDH_EID15                2728
#define RXF5EID15                     2729
#define RXF5EIDL                      2730
#define RXF5EIDL_EID0                 2731
#define RXF5EIDL_EID                  2732
#define RXF5EID0                      2733
#define RXF5EIDL_EID1                 2734
#define RXF5EID1                      2735
#define RXF5EIDL_EID2                 2736
#define RXF5EID2                      2737
#define RXF5EIDL_EID3                 2738
#define RXF5EID3                      2739
#define RXF5EIDL_EID4                 2740
#define RXF5EID4                      2741
#define RXF5EIDL_EID5                 2742
#define RXF5EID5                      2743
#define RXF5EIDL_EID6                 2744
#define RXF5EID6                      2745
#define RXF5EIDL_EID7                 2746
#define RXF5EID7                      2747
#define RXM0SIDH                      2748
#define RXM0SIDH_SID3                 2749
#define RXM0SID3                      2750
#define RXM0SIDH_SID                  2751
#define RXM0SIDH_SID4                 2752
#define RXM0SID4                      2753
#define RXM0SIDH_SID5                 2754
#define RXM0SID5                      2755
#define RXM0SIDH_SID6                 2756
#define RXM0SID6                      2757
#define RXM0SIDH_SID7                 2758
#define RXM0SID7                      2759
#define RXM0SIDH_SID8                 2760
#define RXM0SID8                      2761
#define RXM0SIDH_SID9                 2762
#define RXM0SID9                      2763
#define RXM0SID10                     2764
